Repository: Belfagor2005/StalkerPortalConverter
Catalog: usr/lib/enigma2/python/Plugins/Extensions/StalkerPortalConverter/locale/*/LC_MESSAGES/M3UConverter.po
Languages: it

source: Temporary Storage
it: Memoria Temporanea

source: Disk
it: Disco

source: Top
it: Su

source: Bottom
it: Giu

source: Portal URL:
it: URL del portale:

source: MAC Address:
it: Indirizzo MAC:

source: Output File:
it: File di output:

source: Valid Portals from Selected File:
it: Portali validi dal file selezionato:

source: Expiry:
it: Scadenza:

source: Status:
it: Stato:

source: Active:
it: Attivo:

source: Ready - Select a file or enter URL/MAC
it: Pronto - Seleziona un file o inserisci URL/MAC

source: Clear
it: Pulire

source: Select Playlist
it: Seleziona Playlist

source: Edit
it: Modifica

source: Selected:
it: Seleziona:

source: Loading account info in background...
it: Caricamento delle informazioni dell'account in background...

source: Account info loaded
it: Informazioni sull'account caricate

source: Failed to load account info
it: Impossibile caricare le informazioni dell'account

source: Error accessing configuration values:
it: Errore durante l'accesso ai valori di configurazione:

source: Error: Portal and MAC are required
it: Errore: sono richiesti il ​​portale e il MAC

source: Handshake failed: No token received
it: Handshake fallito: nessun token ricevuto

source: Error extracting account information
it: Errore durante l'accesso ai valori di configurazione

source: Set Type Conversion
it: Conversione del tipo di set

source: Edit Portal URL
it: Modifica URL del portale

source: Edit MAC Address
it: Modifica Indirizzo MAC

source: Select Playlist File
it: Seleziona file playlist

source: Delete Playlist File
it: Elimina file playlist

source: Change Output Directory
it: Cambia directory di output

source: Upgrade Stalker Converter
it: Aggiornamento Convertitore Stalker

source: Information
it: Informazioni

source: Set Bouquet Position
it: Imposta la posizione del bouquet

source: Enter Portal URL (e.g. http://example.com/c/ or http://example.com:8088/c/)
it: URL del portale (esempio http://example.com/c/ o http://example.com:8088/c/)

source: Enter MAC Address (e.g., 00:1A:79:XX:XX:XX)
it: Inserisci l'indirizzo MAC (ad esempio, 00:1A:79:XX:XX:XX)

source: Select Type of Conversion
it: Seleziona il tipo di conversione

source: Bouquet position set to: {}
it: Posizione del bouquet impostata su: {}

source: Select Bouquet Position
it: Seleziona la posizione del bouquet

source: Get ALL portal/MAC from file
it: Ottieni TUTTI i portali/MAC dal file

source: Loaded {} valid portals from {}
it: Caricati {} portali validi da {}

source: No valid portals found in file
it: Nessun portale valido trovato nel file

source: Error:
it: Errore:

source: Scanning file... {}%
it: Scansione del file... {}%

source: Not enough space on {}!
it: Spazio libero insufficiente in {}!

source: Error accessing configuration values
it: Errore durante l'accesso ai valori di configurazione

source: Failed to read portal or MAC configuration:
it: Impossibile leggere il portale o la configurazione MAC:

source: Please enter portal URL and MAC address
it: Inserisci l'URL del portale e l'indirizzo MAC

source: Error: Invalid portal URL
it: Errore: URL del portale non valido

source: Invalid portal URL format
it: Formato URL del portale non valido

source: Error: Invalid MAC address
it: Errore: indirizzo MAC non valido

source: Invalid MAC address format
it: Formato indirizzo MAC non valido

source: Cannot create directory:
it: Impossibile creare la directory:

source: Starting conversion process...
it: Avvio del processo di conversione...

source: Step 1/3: Connecting to portal...
it: Fase 1/3: Connessione al portale...

source: Failed to retrieve channel list
it: Impossibile recuperare l'elenco dei canali

source: Creating playlist file...
it: Creazione del file della playlist...

source: M3U created with {} channels
it: M3U creato con {} canali

source: M3U playlist successfully created with {} channels: {}
it: Playlist M3U creata correttamente con {} canali: {}

source: Grouping: {}
it: Raggruppamento: {}

source: Bouquets created: {} groups with {} channels
it: Bouquet creati: {} gruppi con {} canali

source: Error creating playlist:
it: Errore durante la creazione della playlist:

source: Conversion error:
it: Errore di conversione:

source: Step 1/3: Handshake...
it: Fase 1/3: Handshake...

source: Failed to obtain token!
it: Impossibile ottenere il token!

source: Step 2/3: Authentication...
it: Fase 2/3: Autenticazione...

source: Step 3/3: Getting channels...
it: Fase 3/3: Recupero dell'elenco dei canali…

source: No channels found in response
it: Nessun canale trovato in risposta

source: Preparing {} channels...
it: Elaborazione %s canali...

source: Processed {}/{} channels ({:.1f}/s)
it: Canali elaborati {}/{} ({:.1f}/s)

source: Processed {} of {} channels in {:.1f}s ({:.1f}/s)
it: Processo {} di {} canali in {:.1f}x ({:.1f}/s)

source: Using fallback channel mode
it: Utilizzo della modalità canale di fallback

source: Processed {}/{} channels
it: Canali {}/{} elaborati

source: No writable devices found!
it: Nessun dispositivo scrivibile trovato!

source: << Cancel
it: << Annulla

source: Select storage device
it: Seleziona dispositivo di archiviazione

source: Selected device:
it: Dispositivo selezionato:

source: Error accessing directory:
it: Errore durante l'accesso alla directory:

source: << Back to main menu
it: << Torna al menu principale

source: Select playlist file in: {}
it: Seleziona il file della playlist in: {}

source: No files found in:
it: Nessun file trovato in:

source: Loaded playlist: %s. Are you ready to convert? Press Green to proceed.
it: Playlist caricata: %s. Pronto per la conversione? Premi Verde per procedere.

source: File not found:
it: File non trovato:

source: No files or directories found in:
it: Nessun file di playlist trovato in:

source: Select file to delete in: {}
it: Seleziona il file da eliminare in: {}

source: Are you sure you want to delete: {}?
it: Vuoi davvero eliminare: {}?

source: Deleted:
it: Eliminato:

source: Delete failed:
it: Eliminazione fallita:

source: Convert to M3U
it: Converti in M3U

source: Convert to TV
it: Converti in TV

source: Plugin: StalkerPortalConvert to M3U/TV Author: Lululla Version: %s Date: June 2025 Description: Convert Stalker Portal playlists to M3U or Enigma2 bouquet format. Support: linuxsat-support.com - corvoboys.org
it: Plugin: StalkerPortalConvert in M3U/TV Autore: Lululla Versione: %s Data: giugno 2025 Descrizione: Converti le playlist di Stalker Portal in formato M3U o Enigma2 bouquet. Supporto: linuxsat-support.com - corvoboys.org

source: HELP:
it: AIUTO:

source: - Open a file with server URLs or press the BLUE button to edit the host and MAC address
it: - Aprire un file con gli URL del server o premere il pulsante BLU per modificare l'host e l'indirizzo MAC

source: - Choose the desired output format: M3U or TV bouquet
it: - Scegli il formato di output desiderato: M3U o TV bouquet

source: - Press CONVERT to generate the playlist
it: - Premere CONVERTI per generare la playlist

source: Fields cleared
it: Campi cancellati

source: Unable to fetch version info: {}
it: Impossibile recuperare le informazioni sulla versione: {}

source: You are already running the latest version: {}
it: Stai già utilizzando l'ultima versione: {}

source: New version %s available Changelog: %s Do you want to install it now?
it: Nuova versione %s disponibile Changelog: %s Vuoi installarla ora?

source: You are already running the latest version: %s
it: Stai già utilizzando l'ultima versione: %s

source: Update Aborted!
it: Aggiornamento interrotto!

source: Convert Stalker Portal to M3U playlist with actual channels
it: Converti Stalker Portal in una playlist M3U con canali reali

source: Failed to obtain token
it: Impossibile ottenere il token

source: Authentication failed - continuing anyway
it: Autenticazione fallita - continua comunque

source: Trying alternative channel endpoint...
it: Prova con un endpoint del canale alternativo...

source: Trying XMLTV method...
it: Sto provando il metodo XMLTV...

source: All channel retrieval methods failed
it: Tutti i metodi di recupero del canale sono falliti

source: Critical error:
it: Errore critico :

source: Token endpoint failed:
it: Errore nell'endpoint del token:

source: Generating URLs for {} channels...
it: Generazione di URL per {} canali...

source: Generated {} channels in {:.1f} seconds
it: Generati {} canali in {:.1f} secondi

source: Channel processing error:
it: Errore di elaborazione del canale:

source: Token not found!
it: Token non trovato!

source: Stopping conversion...
it: Interruzione della conversione...

source: Conversion canceled before start
it: Conversione annullata prima dell'inizio

source: Conversion stopped during channel retrieval
it: Conversione interrotta durante il recupero del canale

source: Conversion stopped before bouquet creation
it: Conversione interrotta prima della creazione del bouquet

source: Conversion stopped during bouquet creation
it: Conversione interrotta durante la creazione del bouquet

source: Success!
it: Successo!

source: Error!
it: Errore!

source: Conversion stopped during channel processing
it: Conversione interrotta durante l'elaborazione del canale

source: Conversion stopped during result processing
it: Conversione interrotta durante l'elaborazione dei risultati
