Repository: Belfagor2005/StalkerPortalConverter
Catalog: usr/lib/enigma2/python/Plugins/Extensions/StalkerPortalConverter/locale/*/LC_MESSAGES/StalkerPortalConverter.po
Languages: ar, cs, el, hu, ru, sk

source: Top
ar: أعلى
cs: Nahoře
el: Πάνω
hu: Felső
ru: Сверху
sk: Hore

source: Bottom
ar: أسفل
cs: Dole
el: Κάτω
hu: Alul
ru: Низ
sk: Dole

source: Stalker Portal to M3U Converter v.%s
ar: محول Stalker Portal إلى M3U الإصدار %s
cs: Převodník Stalker Portal do M3U verze %s
el: Μετατροπή πυλών Stalker σε M3U v.%s
hu: Stalker Portal M3U-vá alakító v.%s
ru: Конвертер Stalker Portal в M3U v.%s
sk: Prevodník Stalker Portal do M3U verzie %s

source: Portal URL:
ar: رابط البوابة:
cs: URL portálu:
el: URL πύλης:
hu: Portál URL-címe:
ru: URL-адрес портала:
sk: URL adresa portálu:

source: MAC Address:
ar: عنوان MAC:
cs: MAC adresa:
el: Διεύθυνση MAC:
hu: MAC-cím:
ru: MAC-адрес:
sk: MAC adresa:

source: Output File:
ar: ملف الإخراج:
cs: Výstupní soubor:
el: Αρχείο εξόδου:
hu: Kimeneti fájl:
ru: Выходной файл:
sk: Výstupný súbor:

source: Playlist File:
ar: ملف القائمة:
el: Αρχείο λίστας αναπαραγωγής:

source: Valid Portals from Selected File:
ar: البوابات الصالحة من الملف المحدد:
cs: Platné portály z vybraného souboru:
el: Έγκυρες πύλες από το επιλεγμένο αρχείο:
hu: Érvényes portálok a kiválasztott fájlból:
ru: Действительные порталы из выбранного файла:
sk: Platné portály z vybraného súboru:

source: User:
ar: المستخدم:
cs: Uživatele:
el: Χρήστης:
hu: Felhasználó:
ru: Пользователь:
sk: Používateľ:

source: Password:
ar: كلمة المرور:
cs: Heslo:
el: Κωδικός:
hu: Jelszó:
ru: Пароль:
sk: Heslo:

source: Expiry:
ar: تاريخ الانتهاء:
cs: Datum ukončení platnosti:
el: Λήξη:
hu: Kiemelés lejárata:
ru: Срок действия:
sk: Platnosť do:

source: Status:
ar: الحالة:
cs: Stav:
el: Κατάσταση:
hu: Állapot:
ru: Статус:
sk: Stav:

source: Active:
ar: نشط:
cs: Aktivní:
el: Ενεργό:
hu: Aktív:
ru: Активен:
sk: Aktívne:

source: Max:
ar: الحد الأقصى:
el: Μέγιστοι:
ru: Максимум:

source: Ready - Select a file or enter URL/MAC
ar: جاهز - اختر ملفًا أو أدخل رابط/عنوان MAC
cs: Připraveno - Vyberte soubor nebo zadejte URL/MAC
el: Έτοιμο - Επιλέξτε αρχείο ή εισάγετε URL/MAC
hu: Kész - Válasszon ki egy fájlt, vagy adja meg az URL-t/MAC-címet
ru: Готово — выберите файл или введите URL/MAC
sk: Pripravené – Vyberte súbor alebo zadajte URL/MAC

source: Clear
ar: مسح
cs: Vymazat
el: Καθαρισμός
hu: Törlés
ru: Очистить
sk: Vyčistiť

source: Select Playlist
ar: اختر قائمة التشغيل
cs: Vybrat Playlist
el: Επιλογή Playlist
hu: Lejátszási lista kiválasztása
ru: Выберите плейлист
sk: Vyberte Playlist

source: Edit
ar: تعديل
cs: Upravit
el: Επεξεργασία
hu: Szerkesztés
ru: Редактировать
sk: Upraviť

source: Web Portal Server Off
ar: خادم البوابة متوقف
el: Διακομιστής ιστού πυλών Ανενεργός

source: Press 0: Show Access Code | Press 1: New Code
ar: اضغط 0: إظهار كود الدخول | اضغط 1: كود جديد
el: Πατήστε 0: Εμφάνιση κωδικού πρόσβασης | Πατήστε 1: Νέος κωδικός

source: Access Code:
ar: كود الدخول:
el: Κωδικός πρόσβασης:

source: New Code
ar: كود جديد
el: Νέος κωδικός

source: Show Code
ar: إظهار الكود
el: Εμφάνιση κωδικού

source: Enabled
ar: مفعل
el: Ενεργοποιημένο

source: Disabled
ar: معطل
el: Απενεργοποιημένο

source: VOD inclusion: {}
ar: تضمين الفيديو عند الطلب: {}
el: Συμπερίληψη ταινιών: {}

source: VOD:
ar: فيديو عند الطلب:
el: Ταινίες:

source: Initialization error
ar: خطأ في التهيئة
cs: Chyba inicializace
el: Σφάλμα αρχικοποίησης
hu: Inicializálási hiba
ru: Ошибка инициализации
sk: Chyba inicializácie

source: Stopping current process to switch portal...
ar: جارٍ إيقاف العملية الحالية لتغيير البوابة...
cs: Zastavení aktuálního procesu pro přepnutí portálu...
el: Διακοπή τρέχουσας διαδικασίας για αλλαγή πύλης...
hu: A portálváltáshoz szükséges folyamat leállítása...
ru: Остановка текущего процесса для переключения портала...
sk: Zastavuje sa aktuálny proces prepnutia portálu...

source: Selected:
ar: تم الاختيار:
cs: Vybrané:
el: Επιλέχθηκαν:
hu: Kiválasztott::
ru: Выбрано:
sk: Vybrané:

source: Loading account info in background...
ar: جارٍ تحميل معلومات الحساب في الخلفية...
cs: Načítání informací o účtu na pozadí...
el: Φόρτωση πληροφοριών λογαριασμού στο παρασκήνιο...
hu: Fiókadatok betöltése a háttérben...
ru: Загрузка информации об аккаунте в фоновом режиме...
sk: Načítavajú sa informácie o účte na pozadí...

source: Account info loaded
ar: تم تحميل معلومات الحساب
cs: Informace o účtu byly načteny
el: Οι πληροφορίες λογαριασμού φορτώθηκαν
hu: Fiókadatok betöltve
ru: Информация об аккаунте загружена
sk: Informácie o účte boli načítané

source: Failed to load account info
ar: فشل في تحميل معلومات الحساب
cs: Nepodařilo se načíst informace o účtu
el: Αποτυχία φόρτωσης πληροφοριών λογαριασμού
hu: Nem sikerült betölteni a fiókadatokat
ru: Не удалось загрузить информацию об аккаунте
sk: Nepodarilo sa načítať informácie o účte

source: Error accessing configuration values:
ar: خطأ في الوصول إلى قيم الإعدادات:
cs: Chyba při přístupu k konfiguračním hodnotám:
el: Σφάλμα κατά την πρόσβαση στις τιμές ρυθμίσεων:
hu: Hiba a konfigurációs értékek elérésekor::
ru: Ошибка доступа к значениям конфигурации:
sk: Chyba pri prístupe k konfiguračným hodnotám:

source: Error: Portal and MAC are required
ar: خطأ: الرابط ورقم MAC مطلوبان
cs: Chyba: Vyžadován portál a MAC
el: Σφάλμα: Απαιτούνται πύλη και MAC
hu: Hiba: Portál és MAC cím szükséges
ru: Ошибка: требуются портал и MAC
sk: Chyba: Vyžaduje sa Portál a MAC

source: Handshake failed: No token received
ar: فشل الاتصال: لم يتم استلام الرمز (Token)
cs: Handshake selhal: Nebyl přijat žádný token
el: Η χειραψία απέτυχε: Δεν ελήφθη token
hu: Kézfogás sikertelen: Nem érkezett token
ru: Рукопожатие не удалось: токен не получен
sk: Podanie ruky zlyhalo: Neprijatý nebol žiadny token

source: Error extracting account information
ar: خطأ في استخراج معلومات الحساب
cs: Chyba při extrakci informací o účtu
el: Σφάλμα κατά την εξαγωγή πληροφοριών λογαριασμού
hu: Hiba a fiókadatok kinyerésekor
ru: Ошибка извлечения информации об аккаунте
sk: Chyba pri extrakcii informácií o účte

source: Set Type Conversion
ar: تعيين نوع التحويل
cs: Převod typu sady
el: Ορισμός τύπου μετατροπής
hu: Típuskonverzió beállítása
ru: Преобразование типа набора
sk: Konverzia typu sady

source: Edit Portal URL
ar: تحرير رابط البوابة
cs: Upravit URL portálu
el: Επεξεργασία URL πύλης
hu: Portál URL-címének szerkesztése
ru: Изменить URL портала
sk: Upraviť URL adresu portálu

source: Edit MAC Address
ar: تحرير عنوان MAC
cs: Upravit MAC adresu
el: Επεξεργασία διεύθυνσης MAC
hu: MAC-cím szerkesztése
ru: Изменить MAC-адрес
sk: Upraviť MAC adresu

source: Select Playlist File
ar: اختيار ملف قائمة التشغيل
cs: Vyberte soubor seznamu skladeb
el: Επιλογή αρχείου λίστας αναπαραγωγής
hu: Lejátszási listafájl kiválasztása
ru: Выберите файл плейлиста
sk: Vyberte súbor zoznamu skladieb

source: Delete Playlist File
ar: حذف ملف قائمة التشغيل
cs: Smazat soubor seznamu skladeb
el: Διαγραφή αρχείου λίστας αναπαραγωγής
hu: Lejátszási listafájl törlése
ru: Удалить файл плейлиста
sk: Odstrániť súbor zoznamu skladieb

source: Change Output Directory
ar: تغيير مجلد الإخراج
cs: Změnit výstupní adresář
el: Αλλαγή καταλόγου εξόδου
hu: Kimeneti könyvtár módosítása
ru: Изменить выходной каталог
sk: Zmeniť výstupný adresár

source: Upgrade Stalker Converter
ar: تحديث محول Stalker
cs: Vylepšete převodník Stalker
el: Αναβάθμιση του Stalker Converter
hu: Stalker konverter frissítése
ru: Обновление Сталкера Конвертера
sk: Vylepšiť Stalker Converter

source: Information
ar: معلومات
cs: Informace
el: Πληροφορίες
hu: Információ
ru: Информация
sk: Informácie

source: Set Bouquet Position
ar: تعيين موقع القائمة
cs: Nastavení pozice kytice
el: Ορισμός θέσης μπουκέτου
hu: Csokor pozíciójának beállítása
ru: Установить положение букета
sk: Nastavenie polohy kytice

source: Include VOD in Playlist
ar: تضمين الفيديو عند الطلب في قائمة التشغيل
el: Συμπερίληψη ταινιών στη λίστα αναπαραγωγής

source: Enter Portal URL (e.g. http://example.com/c/ or http://example.com:8088/c/)
ar: أدخل رابط البوابة (مثال: http://example.com/c/ أو http://example.com:8088/c/)
cs: Zadejte URL adresu portálu (např. http://example.com/c/ nebo http://example.com:8088/c/)
el: Εισάγετε το URL πύλης (π.χ. http://example.com/c/ ή http://example.com:8088/c/)
hu: Adja meg a portál URL-címét (pl. http://example.com/c/ vagy http://example.com:8088/c/)
ru: Введите URL-адрес портала (например, http://example.com/c/ или http://example.com:8088/c/)
sk: Zadajte URL adresu portálu (napr. http://example.com/c/ alebo http://example.com:8088/c/)

source: Enter MAC Address (e.g., 00:1A:79:XX:XX:XX)
ar: أدخل عنوان MAC (مثال: 00:1A:79:XX:XX:XX)
cs: Zadejte MAC adresu (např. 00:1A:79:XX:XX:XX)
el: Εισάγετε τη διεύθυνση MAC (π.χ. 00:1A:79:XX:XX:XX)
hu: Írja be a MAC-címet (pl. 00:1A:79:XX:XX:XX)
ru: Введите MAC-адрес (например, 00:1A:79:XX:XX:XX)
sk: Zadajte MAC adresu (napr. 00:1A:79:XX:XX:XX)

source: Select Type of Conversion
ar: اختر نوع التحويل
cs: Vyberte typ konverze
el: Επιλέξτε τύπο μετατροπής
hu: Válassza ki a konverzió típusát
ru: Выберите тип преобразования
sk: Vyberte typ konverzie

source: Bouquet position set to: {}
ar: تم تعيين موقع القائمة إلى: {}
cs: Pozice kytice nastavena na: {}
el: Η θέση του μπουκέτου ορίστηκε σε: {}
hu: A csokor pozíciója beállítva erre: {}
ru: Положение букета установлено на: {}
sk: Pozícia kytice nastavená na: {}

source: Select Bouquet Position
ar: اختر موقع القائمة
cs: Vyberte pozici kytice
el: Επιλέξτε θέση μπουκέτου
hu: Csokor pozíciójának kiválasztása
ru: Выберите позицию букета
sk: Vyberte pozíciu kytice

source: Loaded {} valid entries from {}
ar: تم تحميل {} إدخال صالح من {}
el: Φορτώθηκαν {} έγκυρες καταχωρήσεις από {}

source: No valid entries found in file
ar: لم يتم العثور على إدخالات صالحة في الملف
el: Δεν βρέθηκαν έγκυρες καταχωρήσεις στο αρχείο

source: Error:
ar: خطأ:
cs: Chyba:
el: Σφάλμα:
hu: Hiba:
ru: Ошибка:
sk: Chyba:

source: Scanning file... {}%
ar: جارٍ مسح الملف... {}%
cs: Skenování souboru... {}%
el: Σάρωση αρχείου... {}%
hu: Fájl beolvasása... {}%
ru: Сканирование файла... {}%
sk: Skenovanie súboru... {}%

source: Conversion stopped by user
ar: تم إيقاف التحويل بواسطة المستخدم
cs: Konverze zastavena uživatelem
el: Η μετατροπή διακόπηκε από τον χρήστη
hu: A felhasználó leállította a konverziót
ru: Конверсия остановлена пользователем
sk: Konverziu zastavil používateľ

source: Success!
ar: نجاح!
cs: Úspěch!
el: Επιτυχία!
hu: Siker!:
ru: Выполнено успешно!
sk: Hotovo!

source: Error!
ar: خطأ!
cs: Chyba v UpdateComponents2: {error}
el: Σφάλμα!
hu: Hiba!
ru: Ошибка!
sk: Chyba!

source: Stopping conversion...
ar: جارٍ إيقاف التحويل...
cs: Zastavení konverze...
el: Διακοπή μετατροπής...
hu: Konvertálás leállítása...
ru: Остановка преобразования...
sk: Zastavenie konverzie...

source: Not enough space on {}!
ar: لا يوجد مساحة كافية على {}!
cs: Na disku {} není dostatek místa!
el: Μη επαρκής χώρος στο {}!
hu: Nincs elég hely a(z) {} címen!
ru: Недостаточно места на {}!
sk: Nie je dostatok miesta na {}!

source: Error accessing configuration values
ar: خطأ في الوصول إلى قيم الإعدادات
cs: Chyba při přístupu k konfiguračním hodnotám
el: Σφάλμα πρόσβασης στις τιμές ρυθμίσεων
hu: Hiba a konfigurációs értékek elérésekor
ru: Ошибка доступа к значениям конфигурации
sk: Chyba pri prístupe k konfiguračným hodnotám

source: Failed to read portal or MAC configuration:
ar: فشل في قراءة إعدادات الرابط أو العنوان MAC:
cs: Nepodařilo se načíst konfiguraci portálu nebo MAC adresy:
el: Αποτυχία ανάγνωσης ρυθμίσεων πύλης ή MAC:
hu: Nem sikerült beolvasni a portál vagy a MAC konfigurációját:
ru: Не удалось прочитать конфигурацию портала или MAC:
sk: Nepodarilo sa načítať konfiguráciu portálu alebo MAC adresy:

source: Error: Invalid portal URL
ar: خطأ: الرابط غير صحيح
cs: Chyba: Neplatná URL portálu
el: Σφάλμα: Μη έγκυρο URL πύλης
hu: Hiba: Érvénytelen portál URL
ru: Ошибка: неверный URL портала
sk: Chyba: Neplatná URL adresa portálu

source: Error: Invalid MAC address
ar: خطأ: عنوان MAC غير صحيح
cs: Chyba: Neplatná MAC adresa
el: Σφάλμα: Μη έγκυρη διεύθυνση MAC
hu: Hiba: Érvénytelen MAC-cím
ru: Ошибка: Неверный MAC-адрес
sk: Chyba: Neplatná MAC adresa

source: Cannot create directory:
ar: لا يمكن إنشاء المجلد:
cs: Nelze vytvořit adresář:
el: Αδυναμία δημιουργίας καταλόγου:
hu: Nem lehet létrehozni a következő könyvtárat:
ru: Не удалось создать папку:
sk: Nedá sa vytvoriť adresár:

source: Stop
ar: إيقاف
el: Διακοπή
hu: Megállítás
ru: Стоп

source: Starting conversion process...
ar: جارٍ بدء عملية التحويل...
cs: Zahájení procesu konverze...
el: Έναρξη διαδικασίας μετατροπής...
hu: Konverziós folyamat indítása...
ru: Начинаем процесс конвертации...
sk: Spúšťa sa proces konverzie...

source: Conversion canceled before start
ar: تم إلغاء التحويل قبل البدء
cs: Konverze zrušena před zahájením
el: Η μετατροπή ακυρώθηκε πριν ξεκινήσει
hu: Konverzió megszakítva a kezdés előtt
ru: Конвертация отменена до начала
sk: Konverzia zrušená pred začiatkom

source: Step 1/4: Connecting to portal...
ar: الخطوة 1/4: الاتصال بالبوابة...

source: Conversion stopped during channel retrieval
ar: تم إيقاف التحويل أثناء استرجاع القنوات
cs: Konverze byla zastavena během načítání kanálu
el: Η μετατροπή σταμάτησε κατά την ανάκτηση των καναλιών
hu: A konverzió leállt a csatorna lekérése során
ru: Конвертация остановлена во время поиска канала
sk: Konverzia sa zastavila počas načítania kanála

source: Failed to retrieve channel list
ar: فشل في استرجاع قائمة القنوات
cs: Nepodařilo se načíst seznam kanálů
el: Αποτυχία ανάκτησης λίστας καναλιών
hu: Nem sikerült lekérni a csatornalistát
ru: Не удалось получить список каналов.
sk: Nepodarilo sa načítať zoznam kanálov

source: Step 2/4: Creating playlist file...
ar: الخطوة 2/4: إنشاء ملف القائمة...

source: Step 3/4: Create M3U file...
ar: الخطوة 3/4: إنشاء ملف M3U...

source: Conversion stopped during M3U creation
ar: تم إيقاف التحويل أثناء إنشاء ملف M3U
cs: Konverze byla zastavena během vytváření M3U
el: Η μετατροπή διακόπηκε κατά τη δημιουργία του M3U
hu: A konvertálás leállt az M3U létrehozása során
ru: Конвертация остановлена во время создания M3U
sk: Konverzia sa zastavila počas vytvárania M3U

source: Step 4/4: Getting VOD content...
ar: الخطوة 4/4: جلب محتوى الفيديو عند الطلب...
el: Βήμα 4/4: Λήψη περιεχομένου ταινιών...

source: Added {} VOD items
ar: تمت إضافة {} عنصر فيديو عند الطلب
el: Προστέθηκαν {} στοιχεία ταινιών

source: M3U created with {} channels
ar: تم إنشاء ملف M3U يحتوي على {} قناة
cs: M3U vytvořeno s {} kanály
el: Δημιουργήθηκε M3U με {} κανάλια
hu: M3U létrehozva {} csatornával
ru: M3U создан с {} каналами
sk: M3U vytvorené s {} kanálmi

source: Step 3/4: Create Bouquet file...
ar: الخطوة 3/4: إنشاء ملف القائمة...

source: Conversion stopped during grouping
ar: تم إيقاف التحويل أثناء التجميع
cs: Konverze zastavena během seskupování
el: Η μετατροπή σταμάτησε κατά την ομαδοποίηση
hu: A konverzió leállt a csoportosítás során
ru: Конвертация остановлена во время группировки
sk: Konverzia sa zastavila počas zoskupovania

source: Grouping: {}
ar: التجميع: {}
cs: Seskupení: {}
el: Ομαδοποίηση: {}
hu: Csoportosítás: {}
ru: Группировка: {}
sk: Zoskupenie: {}

source: Conversion stopped before bouquet creation
ar: تم إيقاف التحويل قبل إنشاء القائمة
cs: Konverze byla zastavena před vytvořením kytice
el: Η μετατροπή σταμάτησε πριν τη δημιουργία του μπουκέτου
hu: A konverzió leállt a csokor létrehozása előtt
ru: Конвертация остановлена до создания букета
sk: Konverzia bola zastavená pred vytvorením kytice

source: Conversion stopped during bouquet creation
ar: تم إيقاف التحويل أثناء إنشاء القائمة
cs: Konverze byla zastavena během vytváření kytice
el: Η μετατροπή σταμάτησε κατά τη δημιουργία του μπουκέτου
hu: A konverzió leállt a csokor létrehozása közben
ru: Конвертация остановлена во время создания букета
sk: Konverzia sa zastavila počas vytvárania kytice

source: Bouquets created: {} groups with {} channels
ar: تم إنشاء {} مجموعة تحتوي على {} قناة
cs: Vytvořeno kyticí: {} skupin s {} kanály
el: Δημιουργήθηκαν μπουκέτα: {} ομάδες με {} κανάλια
hu: Csokrok létrehozva: {} csoport {} csatornával
ru: Создано букетов: {} групп с {} каналами
sk: Vytvorené kytice: {} skupín s {} kanálmi

source: Error creating playlist:
ar: خطأ في إنشاء قائمة التشغيل:
cs: Chyba při vytváření playlistu:
el: Σφάλμα κατά τη δημιουργία playlist:
hu: Hiba a lejátszási lista létrehozásakor:
ru: Ошибка создания плейлиста:
sk: Chyba pri vytváraní zoznamu skladieb:

source: Conversion error:
ar: خطأ في التحويل:
cs: Chyba konverze:
el: Σφάλμα μετατροπής:
hu: Konverziós hiba:
ru: Ошибка преобразования:
sk: Chyba konverzie:

source: Step 1/3: Handshake...
ar: الخطوة 1/3: الاتصال الأولي...
cs: Krok 1/3: Podání ruky...
el: Βήμα 1/3: Χειραψία...
hu: 1/3. lépés: Kézfogás...
ru: Шаг 1/3: Рукопожатие...
sk: Krok 1/3: Podanie ruky...

source: Failed to obtain token!
ar: فشل في الحصول على الرمز (Token)!
cs: Nepodařilo se získat token!
el: Αποτυχία λήψης token!
hu: Nem sikerült tokent beszerezni!
ru: Не удалось получить токен!
sk: Nepodarilo sa získať token!

source: Step 2/3: Authentication...
ar: الخطوة 2/3: المصادقة...
cs: Krok 2/3: Ověření...
el: Βήμα 2/3: Ταυτοποίηση...
hu: 2/3. lépés: Hitelesítés...
ru: Шаг 2/3: Аутентификация...
sk: Krok 2/3: Autentifikácia...

source: Step 3/3: Getting channels...
ar: الخطوة 3/3: جلب القنوات...
cs: Krok 3/3: Získávání kanálů...
el: Βήμα 3/3: Λήψη καναλιών...
hu: 3/3. lépés: Csatornák beszerzése...
ru: Шаг 3/3: Получение каналов...
sk: Krok 3/3: Získanie kanálov...

source: No channels found in response
ar: لم يتم العثور على قنوات في الاستجابة
cs: V odpovědi nebyly nalezeny žádné kanály
el: Δεν βρέθηκαν κανάλια στην απόκριση
hu: Nem található csatorna a válaszban
ru: Каналов в ответе не найдено
sk: V odpovedi sa nenašli žiadne kanály

source: Preparing %d channels...
ar: جارٍ إعداد %d قناة...
cs: Příprava %d kanálů...
el: Προετοιμασία %d καναλιών...
hu: %d csatorna előkészítése...
ru: Подготовка %d каналов...
sk: Príprava %d kanálov...

source: Conversion stopped during channel processing
ar: تم إيقاف التحويل أثناء معالجة القنوات
cs: Konverze byla zastavena během zpracování kanálu
el: Η μετατροπή σταμάτησε κατά την επεξεργασία των καναλιών
hu: A konverzió leállt a csatornafeldolgozás során
ru: Конвертация остановлена во время обработки канала
sk: Konverzia bola zastavená počas spracovania kanála

source: Conversion stopped during result processing
ar: تم إيقاف التحويل أثناء معالجة النتائج
cs: Konverze byla zastavena během zpracování výsledků
el: Η μετατροπή σταμάτησε κατά την επεξεργασία των αποτελεσμάτων
hu: Az átalakítás leállt az eredményfeldolgozás során
ru: Конвертация остановлена во время обработки результата
sk: Konverzia sa zastavila počas spracovania výsledku

source: Processed {}/{} channels ({:.1f}%) Elapsed: {:.1f}s | Avg speed: {:.1f}/s | ETA: {:.1f}s
ar: تم معالجة {}/{} قناة ({}%.1f%) الزمن المنقضي: {}%.1f ثانية | السرعة المتوسطة: {}%.1f قناة/ثانية | الوقت المتبقي المتوقع: {}%.1f ثانية
el: Επεξεργάστηκαν {}/{} κανάλια ({:.1f}%) Παρήλθαν: {:.1f}s | Μέση ταχύτητα: {:.1f}/s | Εκτιμώμενος χρόνος: {:.1f}s

source: Processed {}/{} channels ({:.1f}%) | Elapsed: {:.1f}s | Avg speed: {:.1f}/s
ar: تم معالجة {}/{} قناة ({}%.1f%) | الزمن المنقضي: {}%.1f ثانية | السرعة المتوسطة: {}%.1f قناة/ثانية
cs: Zpracováno {}/{} kanálů ({:.1f} %) | Uplynulo: {:.1f} s | Průměrná rychlost: {:.1f}/s
el: Επεξεργάστηκαν {}/{} κανάλια ({:.1f}%) | Παρήλθαν: {:.1f}s | Μέση ταχύτητα: {:.1f}/s
hu: Feldolgozott {}/{} csatorna ({:.1f}%) | Eltelt idő: {:.1f} s | Átlagos sebesség: {:.1f}/s
ru: Обработано {}/{} каналов ({:.1f}%) | Прошло: {:.1f} с | Средняя скорость: {:.1f}/с
sk: Spracované kanály: {}/{} ({:.1f} %) | Uplynutý čas: {:.1f} s | Priemerná rýchlosť: {:.1f}/s

source: Step 1/2: Getting VOD categories...
ar: الخطوة 1/2: جلب فئات الفيديو عند الطلب...

source: Step 3/3: Return VOD categories...
ar: الخطوة 3/3: إعادة فئات الفيديو عند الطلب...

source: Step 2/3: Return VOD json_data...
ar: الخطوة 2/3: إعادة بيانات الفيديو عند الطلب بصيغة JSON...

source: Select this directory
ar: اختر هذا المجلد
cs: Vyberte tento adresář
el: Επιλέξτε αυτόν τον κατάλογο
hu: Válassza ki ezt a könyvtárat
ru: Выберите этот каталог
sk: Vyberte tento adresár

source: Error accessing directory:
ar: خطأ في الوصول إلى المجلد:
cs: Chyba při přístupu k adresáři:
el: Σφάλμα πρόσβασης στον κατάλογο:
hu: Hiba a könyvtár elérésekor:
ru: Ошибка доступа к каталогу:
sk: Chyba pri prístupe k adresáru:

source: << Cancel
ar: << إلغاء
cs: << Zrušit
el: << Άκυρο
hu: << Mégsem
ru: << Отменить
sk: << Zrušiť

source: Select playlist file
ar: اختيار ملف قائمة التشغيل
cs: Vyberte soubor playlistu
el: Επιλέξτε αρχείο λίστας αναπαραγωγής
hu: Lejátszási lista fájljának kiválasztása
ru: Выберите файл плейлиста
sk: Vyberte súbor so zoznamom skladieb

source: Select directory
ar: اختيار مجلد
cs: Vybrat adresář
el: Επιλέξτε κατάλογο
hu: Katalógus választás
ru: Выбрать каталог
sk: Vyberte adresár

source: No files found in:
ar: لا توجد ملفات في:
cs: Nebyly nalezeny žádné soubory v:
el: Δεν βρέθηκαν αρχεία στο:
hu: Nem találhatók fájlok a következő helyen:
ru: Файлы не найдены в:
sk: Nenašli sa žiadne súbory v:

source: Selected directory:
ar: المجلد المحدد:
cs: Vybraný adresář:
el: Επιλεγμένος κατάλογος:
hu: Kiválasztott könyvtár:
ru: Выбранный каталог:
sk: Vybraný adresár:

source: Loaded playlist: %s
ar: تم تحميل قائمة التشغيل: %s
cs: Načtený seznam skladeb: %s
el: Φορτώθηκε λίστα αναπαραγωγής: %s
hu: Lejátszási lista betöltése: %s
ru: Загруженный плейлист: %s
sk: Načítaný zoznam skladieb: %s

source: No files or directories found in:
ar: لا توجد ملفات أو مجلدات في:
cs: Nebyly nalezeny žádné soubory ani adresáře v:
el: Δεν βρέθηκαν αρχεία ή κατάλογοι στο:
hu: Nem találhatók fájlok vagy könyvtárak itt:
ru: Файлы или каталоги не найдены в:
sk: Nenašli sa žiadne súbory ani adresáre v:

source: << Back to main menu
ar: << العودة إلى القائمة الرئيسية
cs: << Zpět do hlavní nabídky
el: << Επιστροφή στο κύριο μενού
hu: << Vissza a főmenübe
ru: << Вернуться в главное меню
sk: << Späť do hlavnej ponuky

source: Select file to delete in: {}
ar: اختر ملفًا للحذف من: {}
cs: Vyberte soubor, který chcete smazat: {}
el: Επιλέξτε αρχείο για διαγραφή στο: {}
hu: Válassza ki a törlendő fájlt a következőből: {}
ru: Выберите файл для удаления в: {}
sk: Vyberte súbor, ktorý chcete odstrániť v: {}

source: Are you sure you want to delete: {}?
ar: هل أنت متأكد من رغبتك في حذف: {}؟
cs: Opravdu chcete smazat: {}?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε το: {};
hu: Biztosan törölni szeretnéd ezt: {}?
ru: Вы уверены, что хотите удалить: {}?
sk: Naozaj chcete odstrániť: {}?

source: Deleted:
ar: تم الحذف:
cs: Smazáno:
el: Διαγράφηκε:
hu: Törölt:
ru: Удалено:
sk: Odstránené:

source: Delete failed:
ar: فشل الحذف:
cs: Smazání se nezdařilo:
el: Η διαγραφή απέτυχε:
hu: Törlés sikertelen:
ru: Удаление не удалось:
sk: Odstránenie zlyhalo:

source: Convert to M3U
ar: تحويل إلى M3U
cs: Převést do M3U
el: Μετατροπή M3U
hu: Konvertálás M3U-ra
ru: Конвертировать в M3U
sk: Konvertovať do M3U

source: Convert to TV
ar: تحويل إلى TV
cs: Převést na televizi
el: Μετατροπή TV
hu: Átalakítás TV-re
ru: Конвертировать в ТВ
sk: Previesť na televízor
