Repository: Belfagor2005/StalkerPortalConverter
Catalog: usr/lib/enigma2/python/Plugins/Extensions/StalkerPortalConverter/locale/*/LC_MESSAGES/StalkerPortalConverter.po
Languages: ar, cs, el, hu, ru, sk

source: Plugin: StalkerPortalConvert to M3U/TV Author: Lululla Version: %s Date: June 2025 Description: Convert Stalker Portal playlists to M3U or Enigma2 bouquet format. Support: linuxsat-support.com - corvoboys.org
ar: البرنامج المساعد: تحويل بوابة Stalker إلى M3U/TV المؤلف: Lululla الإصدار: %s التاريخ: يونيو 2025 الوصف: تحويل قوائم تشغيل بوابة Stalker إلى صيغة M3U أو صيغة القوائم في Enigma2. الدعم: linuxsat-support.com - corvoboys.org
cs: Plugin: StalkerPortalConvert to M3U/TV Autor: Lululla Verze: %s Datum: červen 2025 Popis: Převod playlistů Stalker Portal do formátu M3U nebo Enigma2 bouquet. Podpora: linuxsat-support.com - corvoboys.org
el: Πρόσθετο: StalkerPortalConvert σε M3U/TV Συγγραφέας: Lululla Έκδοση: %s Ημερομηνία: Ιούνιος 2025 Περιγραφή: Μετατροπή λιστών πυλών Stalker σε μορφή M3U ή μπουκέτων Enigma2. Υποστήριξη: linuxsat-support.com - corvoboys.org
hu: Bővítmény: StalkerPortalConvert to M3U/TV Szerző: Lululla Verzió: %s Dátum: 2025. június Leírás: Stalker Portal lejátszási listák konvertálása M3U vagy Enigma2 csokor formátumba. Támogatás: linuxsat-support.com - corvoboys.org
ru: Плагин: StalkerPortalConvert to M3U/TV Автор: Lululla Версия: %s Дата: июнь 2025 г. Описание: Конвертировать плейлисты Stalker Portal в формат M3U или Enigma2 Bouquet. Поддержка: linuxsat-support.com - corvoboys.org
sk: Plugin: StalkerPortalConvert to M3U/TV Autor: Lululla Verzia: %s Dátum: jún 2025 Popis: Konvertuje playlisty Stalker Portal do formátu M3U alebo Enigma2 bouquet. Podpora: linuxsat-support.com - corvoboys.org

source: HELP:
ar: مساعدة:
cs: POMOC:
el: ΒΟΗΘΕΙΑ:
hu: SEGÍTSÉG:
ru: ПОМОЩЬ:
sk: POMOC:

source: - Open a file with server URLs or press the BLUE button to edit the host and MAC address
ar: - افتح ملف يحتوي على روابط الخوادم أو اضغط الزر الأزرق لتحرير اسم المضيف وعنوان MAC
cs: - Otevřete soubor s URL adresami serverů nebo stiskněte MODRÉ tlačítko pro úpravu hostitele a MAC adresy.
el: - Ανοίξτε ένα αρχείο με URL διακομιστών ή πατήστε το ΜΠΛΕ κουμπί για να επεξεργαστείτε τον host και τη διεύθυνση MAC
hu: - Nyisson meg egy fájlt a szerver URL-címeivel, vagy nyomja meg a KÉK gombot a gazdagép és a MAC-cím szerkesztéséhez.
ru: - Откройте файл с URL-адресами серверов или нажмите СИНЮЮ кнопку, чтобы изменить хост и MAC-адрес
sk: - Otvorte súbor s URL adresami serverov alebo stlačte MODRÉ tlačidlo pre úpravu hostiteľa a MAC adresy.

source: - Choose the desired output format: M3U or TV bouquet
ar: - اختر الصيغة المرغوبة للإخراج: M3U أو قائمة TV
cs: - Vyberte požadovaný výstupní formát: M3U nebo TV bouquet
el: - Επιλέξτε την επιθυμητή μορφή εξόδου: M3U ή μπουκέτο TV
hu: - Válassza ki a kívánt kimeneti formátumot: M3U vagy TV-csokor
ru: - Выберите желаемый выходной формат: M3U или TV-букет
sk: - Vyberte požadovaný výstupný formát: M3U alebo TV bouquet

source: - Press CONVERT to generate the playlist
ar: - اضغط على زر التحويل لإنشاء قائمة التشغيل
cs: - Stisknutím tlačítka CONVERT vygenerujete seznam skladeb
el: - Πατήστε ΜΕΤΑΤΡΟΠΗ για να δημιουργήσετε τη λίστα αναπαραγωγής
hu: - Nyomja meg a KONVERTÁLÁS gombot a lejátszási lista létrehozásához
ru: - Нажмите CONVERT, чтобы создать плейлист.
sk: - Stlačením tlačidla KONVERTOVAŤ vygenerujete zoznam skladieb

source: Fields cleared
ar: تم مسح الحقول
cs: Pole vyčištěna
el: Τα πεδία καθαρίστηκαν
hu: Mezők kiürítve
ru: Поля очищены
sk: Polia vymazané

source: Unable to fetch version info: {}
ar: تعذر جلب معلومات الإصدار: {}
cs: Nelze načíst informace o verzi: 0}
el: Αδυναμία λήψης πληροφοριών έκδοσης: {}
hu: Nem sikerült lekérni a verzióinformációkat: {}
ru: Не удалось получить информацию о версии: {}
sk: Nepodarilo sa načítať informácie o verzii: 0}

source: You are already running the latest version: {}
ar: أنت تستخدم آخر إصدار بالفعل: {}
cs: Již používáte nejnovější verzi: {}
el: Χρησιμοποιείτε ήδη την πιο πρόσφατη έκδοση: {}
hu: Már a legújabb verziót futtatod: {}
ru: Вы уже используете последнюю версию: {}
sk: Už používate najnovšiu verziu: {}

source: New version %s available Changelog: %s Do you want to install it now?
ar: الإصدار الجديد %s متاح سجل التغييرات: %s هل ترغب بتثبيته الآن؟
cs: Nová verze %s k dispozici Seznam změn: %s Chcete ji nyní nainstalovat?
el: Διαθέσιμη νέα έκδοση %s Καταγραφή αλλαγών: %s Θέλετε να την εγκαταστήσετε τώρα;
hu: Új verzió (%s) elérhető Változásnapló: %s Telepíteni szeretnéd most?
ru: Доступна новая версия %s Журнал изменений: %s Вы хотите установить ее сейчас?
sk: Nová verzia %s je k dispozícii Zoznam zmien: %s Chcete ju teraz nainštalovať?

source: You are already running the latest version: %s
ar: أنت تستخدم آخر إصدار بالفعل: %s
cs: Již používáte nejnovější verzi: %s
el: Χρησιμοποιείτε ήδη την πιο πρόσφατη έκδοση: %s
hu: Már a legújabb verziót futtatod: %s
ru: Вы уже используете последнюю версию: %s
sk: Už používate najnovšiu verziu: %s

source: Update Aborted!
ar: تم إلغاء التحديث!
cs: Aktualizace zrušena!
el: Η ενημέρωση ακυρώθηκε!
hu: Frissítés megszakítva!
ru: Обновление прервано!
sk: Aktualizácia prerušená!

source: Web Portal Server On
ar: خادم البوابة يعمل
el: Διακομιστής ιστού πυλών Ενεργός

source: Web server: http://%s:%d
ar: خادم الويب: http://%s:%d
el: Διακομιστής ιστού: http://%s:%d

source: Web server error:
ar: خطأ في خادم الويب:
el: Σφάλμα διακομιστή ιστού:

source: Web server stopped
ar: تم إيقاف خادم الويب
el: Ο διακομιστής ιστού σταμάτησε

source: You need to start the Web Server first!
ar: يجب عليك تشغيل خادم الويب أولًا!
el: Πρέπει πρώτα να ξεκινήσετε τον διακομιστή ιστού!

source: Hide Code
ar: إخفاء الكود
el: Απόκρυψη κωδικού

source: New Access Code:
ar: كود دخول جديد:
el: Νέος κωδικός:

source: New access code generated!
ar: تم إنشاء كود دخول جديد!
el: Δημιουργήθηκε νέος κωδικός πρόσβασης!

source: Convert Stalker Portal to M3U playlist with actual channels
ar: تحويل بوابة Stalker إلى قائمة M3U تحتوي على القنوات الفعلية
cs: Převod Stalker Portal do playlistu M3U se skutečnými kanály
el: Μετατροπή Stalker Portal σε M3U playlist με πραγματικά κανάλια
hu: A Stalker Portal konvertálása M3U lejátszási listává tényleges csatornákkal
ru: Конвертировать Stalker Portal в плейлист M3U с реальными каналами
sk: Prevod Stalker Portal do playlistu M3U so skutočnými kanálmi

source: Step 1/3: Connecting to portal...
cs: Krok 1/3: Připojení k portálu...
el: Βήμα 1/3: Σύνδεση με την πύλη...
hu: 1/3. lépés: Kapcsolódás a portálhoz...
ru: Шаг 1/3: Подключение к порталу...
sk: Krok 1/3: Pripájanie k portálu...

source: Step 2/3: Creating playlist file...
cs: Krok 2/3: Vytvoření souboru seznamu skladeb...
el: Βήμα 2/3: Δημιουργία αρχείου λίστας αναπαραγωγής...
hu: 2/3. lépés: Lejátszási listafájl létrehozása...
ru: Шаг 2/3: Создание файла плейлиста...
sk: Krok 2/3: Vytvorenie súboru so zoznamom skladieb...

source: Step 3/3: Create M3U file...
cs: Krok 3/3: Vytvořte soubor M3U...
el: Βήμα 3/3: Δημιουργία αρχείου M3U...
hu: 3/3. lépés: M3U fájl létrehozása...
ru: Шаг 3/3: Создайте файл M3U...
sk: Krok 3/3: Vytvorenie súboru M3U...

source: Step 3/3: Create Bouquet file...
cs: Krok 3/3: Vytvořte soubor Kytice...
el: Βήμα 3/3: Δημιουργία αρχείου μπουκέτου...
hu: 3/3. lépés: Csokorfájl létrehozása...
ru: Шаг 3/3: Создание файла «Букет»...
sk: Krok 3/3: Vytvorenie súboru Kytica...

source: Get ALL portal/MAC from file
cs: Získejte VŠECHNY portály/MAC adresy ze souboru
hu: ÖSSZES portál/MAC cím lekérése fájlból
ru: Получить ВСЕ порталы/MAC из файла
sk: Získať VŠETKY portály/MAC adresy zo súboru

source: Loaded {} valid portals from {}
cs: Načteno {} platných portálů z {}
hu: {} érvényes portál betöltve innen: {}
ru: Загружено {} действительных порталов из {}
sk: Načítaných {} platných portálov z {}

source: No valid portals found in file
cs: V souboru nebyly nalezeny žádné platné portály
hu: Nem található érvényes portál a fájlban
ru: В файле не найдено ни одного допустимого портала
sk: V súbore sa nenašli žiadne platné portály

source: Processed {}/{} channels ({:.1f}%) | Elapsed: {:.1f}s | Avg speed: {:.1f}/s | ETA: {:.1f}s
cs: Zpracováno {}/{} kanálů ({:.1f} %) | Uplynulo: {:.1f} s | Průměrná rychlost: {:.1f}/s | Předpokládaný čas příjezdu: {:.1f} s
hu: Feldolgozott {}/{} csatorna ({:.1f}%) | Eltelt idő: {:.1f} mp | Átlagos sebesség: {:.1f}/s | Várható érkezés: {:.1f} mp
ru: Обработано {}/{} каналов ({:.1f}%) | Прошло: {:.1f} с | Средняя скорость: {:.1f}/с | ETA: {:.1f} с
sk: Spracované kanály: {}/{} ({:.1f} %) | Uplynutý čas: {:.1f} s | Priemerná rýchlosť: {:.1f}/s | Predpokladaný čas príchodu: {:.1f} s
